tsung/new_tests/tsung_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='100'/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second" />
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
  </load>
  

  <options>
    <option name="file_server" id="default" value="users.csv"/>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000" />
  </options>

  <sessions>
    <session name="fundamental_investor" probability="100" type="ts_http">

      <setdynvars sourcetype="file" fileid="default" delimiter="," order="iter">
        <var name="username" />
        <var name="password" />
        <var name="balance" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="stock_id" />
      </setdynvars>

      <!-- Homepage -->
      <request>
        <http url="/"
              method="GET"
        />
      </request>

      <!-- Log In -->
      <request>
        <http url="/login"
              method="GET"
        />
      </request>
      <request subst="true">
        <http url="/sessions.json"
              method="POST"
              content_type="application/json"
              contents="{&quot;name&quot;: &quot;%%_username%%&quot;, &quot;password&quot;: &quot;%%_password%%&quot;}"
        />
      </request>

      <!-- ALTERNATIVE JSON METHOD
      <request>
        <http url="/sessions.json"
              method="POST"
              content_type='application/json'
              contents_from_file="../request_body/login_body.json"
        />
      </request> -->

      <!-- Homepage -->
      <request>
        <http url="/"
              method="GET"
        />
      </request>

      <!-- Wait -->
      <thinktime value="5" random="true"/>
	
      <!-- View Stocks Page -->
      <request>
        <http url="/stocks"
              method="GET"
        />
      </request>

      <!-- Wait -->
      <thinktime value="5" random="true"/>

	      <!-- Grab User ID -->
      <!--
      <request>
        <dyn_variable name="user_id" xpath='//*[@id="transaction_user_id"]/@value'></dyn_variable>
        <http url="/transactions/new"
              method="GET"
        />
	      </request>
      -->

      <!-- ALTERNATIVE WAY TO GRAB USER ID
      <request>
        <dyn_variable name="user_id"></dyn_variable>
        <http url="/transactions/new"
              method="GET"
        />
      </request>
      -->

      <!-- Buy Stock -->
      <request subst="true">
        <http url="/transactions"
              method="POST"
              content_type="application/json"
              contents="{&quot;stock_id&quot;: %%_stock_id%%, &quot;num_shares&quot;: 5, &quot;transaction_type&quot;: &quot;buy&quot;}"
        />
      </request>

      <!-- JSON METHOD
      <request>
        <http url="/stocks.json"
              method="POST"
              content_type='application/json'
              contents_from_file="../request_body/stock_add_body.json"
        />
      </request>
      -->

      <!-- Wait -->
      <thinktime value="5" random="true"/>

      <!-- Sell Stock -->
      <request subst="true">
        <http url="/transactions"
              method="POST"
              content_type="application/json"
		contents="{&quot;stock_id&quot;: %%_stock_id%%, &quot;num_shares&quot;: 5, &quot;transaction_type&quot;: &quot;sell&quot;}"
		/>
      </request>

      <!-- JSON METHOD
      <request>
        <http url="/transactions"
              method="POST"
              content_type='application/json'
              contents_from_file="../request_body/transaction_sell_body.json"
        />
      </request>
      -->

      <!-- View Stocks Page -->
      <request>
        <http url="/stocks"
              method="GET"
        />
      </request>
      <!-- Wait -->
      <thinktime value="5" random="true"/>

      <!-- Buy Stock -->
      <request subst="true">
        <http url="/transactions"
              method="POST"
              content_type="application/json"
		contents="{&quot;stock_id&quot;: %%_stock_id%%, &quot;num_shares&quot;: 7, &quot;transaction_type&quot;: &quot;buy&quot;}"
		/>
      </request>

      <!-- View Transactions Page -->
      <request>
        <http url="/transactions/new"
              method="GET"
        />
      </request>

      <!-- Wait -->
      <thinktime value="5" random="true"/>

      <!-- Sell Stock -->
      <request subst="true">
        <http url="/transactions"
              method="POST"
              content_type="application/json"
		contents="{&quot;stock_id&quot;: %%_stock_id%%, &quot;num_shares&quot;: 7, &quot;transaction_type&quot;: &quot;sell&quot;}"
		/>
      </request>

    </session>
  </sessions>
</tsung>